-- CardImageMap.lua
-- 花札カードコード "MMKK" → 画像アセットID を返す

local M = {}

local MAP = {
    ["0101"] = "rbxassetid://110167745897883",
    ["0102"] = "rbxassetid://93498789800334",
    ["0103"] = "rbxassetid://133103780529932",
    ["0104"] = "rbxassetid://136642428171395",
    ["0201"] = "rbxassetid://132367699583326",
    ["0202"] = "rbxassetid://134345351537648",
    ["0203"] = "rbxassetid://135460725123644",
    ["0204"] = "rbxassetid://89684082664904",
    ["0301"] = "rbxassetid://73087713183501",
    ["0302"] = "rbxassetid://81006823565341",
    ["0303"] = "rbxassetid://77095165720075",
    ["0304"] = "rbxassetid://85687753998090",
    ["0401"] = "rbxassetid://101221945021316",
    ["0402"] = "rbxassetid://77347428563752",
    ["0403"] = "rbxassetid://127837226730063",
    ["0404"] = "rbxassetid://79125904590127",
    ["0501"] = "rbxassetid://87645273830323",
    ["0502"] = "rbxassetid://94073795568801",
    ["0503"] = "rbxassetid://124341314863776",
    ["0504"] = "rbxassetid://132896106155044",
    ["0601"] = "rbxassetid://132616480451100",
    ["0602"] = "rbxassetid://124641940516424",
    ["0603"] = "rbxassetid://79357236000602",
    ["0604"] = "rbxassetid://135731147846223",
    ["0701"] = "rbxassetid://132491564698284",
    ["0702"] = "rbxassetid://91828122936676",
    ["0703"] = "rbxassetid://86256620341158",
    ["0704"] = "rbxassetid://82894930779013",
    ["0801"] = "rbxassetid://87397718241868",
    ["0802"] = "rbxassetid://128009125288955",
    ["0803"] = "rbxassetid://131676198229808",
    ["0804"] = "rbxassetid://87762677221025",
    ["0901"] = "rbxassetid://88046091737846",
    ["0902"] = "rbxassetid://71524569266527",
    ["0903"] = "rbxassetid://83957385030032",
    ["0904"] = "rbxassetid://128219000509304",
    ["1001"] = "rbxassetid://74033195147455",
    ["1002"] = "rbxassetid://73399886152412",
    ["1003"] = "rbxassetid://88813065287954",
    ["1004"] = "rbxassetid://110394629504663",
    ["1101"] = "rbxassetid://84968179943715",
    ["1102"] = "rbxassetid://71616531834256",
    ["1103"] = "rbxassetid://86303293761445",
    ["1104"] = "rbxassetid://119930258214285",
    ["1201"] = "rbxassetid://127632446804292",
    ["1202"] = "rbxassetid://103521315547130",
    ["1203"] = "rbxassetid://123439248481137",
    ["1204"] = "rbxassetid://119065326867849",
}

function M.get(code)
    return MAP[code]
end

function M.getByMonthIdx(month, idx)
    return MAP[string.format("%02d%02d", month, idx)]
end

return M
